espruino/Espruino/targetlibs/nrf5x/nrf51_sdk/components/serialization/common/transport/ser_phy/ser_phy_nrf51_uart_stm_app.c
/* Copyright (c) Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice, this
 * list of conditions and the following disclaimer in the documentation and/or
 * other materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of other
 * contributors to this software may be used to endorse or promote products
 * derived from this software without specific prior written permission.
 *
 * 4. This software must only be used in a processor manufactured by Nordic
 * Semiconductor ASA, or in a processor manufactured by STMicroelectronics that
 * is used in combination with a processor manufactured by Nordic Semiconductor
 * or in a processor manufactured by STMicroelectronics.
 *
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */


#include <stdint.h>
#include <stdlib.h>

#include "nordic_common.h"
#include "boards.h"
#include "nrf51.h"
#include "nrf51_bitfields.h"
#include "nrf_error.h"
#include "nrf_gpio.h"
#include "nrf_delay.h"
#include "nrf_gpiote.h"
#include "app_gpiote.h"
#include "app_util.h"
#include "app_util_platform.h"

#include "ser_phy.h"
#include "ser_phy_config_app_nrf51.h"

#define UART_PIN_DISCONNECTED 0xFFFFFFFF /**< Value indicating that no pin is connected to this UART register. */

/** @brief States for the app_uart state machine. */
typedef enum
{
    UART_IDLE,              /**< Indicating that the current status for either RX or TX is idle. When both RX and TX is idle the UART will be disabled in order to save power. */
    UART_RX,                /**< Used to indicate that a packet is currently being received on RX. */
    UART_RX_PENDING,        /**< Used to indicate that byte is ready at RXD register but no buffer was available when the byte was received. The byte will be pulled when a buffer is set. */
    UART_TX_COMPLETE,       /**< Used on TX to indicate that final byte has been put on TXD register. Next TXDRDY interrupt will indicate that last byte has been transmitted. */
    UART_TX_SEND,           /**< Used to indicate that a packet is currently being transmitted on TX. */
    UART_TX_LAST_BYTE_WAIT, /**< Used to indicate that the last byte on a TX packet is currently waiting to be transmitted when CTS goes low. Note that flow control is off when tranmitting final byte. */
    UART_STALL,             /**< Indicates that TX is stalled because final byte is being received on the UART. */
} uart_states_t;

static volatile uint32_t m_pin_cts_mask; /**< CTS pin mask for UART module. */

static volatile uint8_t * mp_tx_stream;                          /**< Pointer to array of data packet to be transmitted. */
static volatile uint16_t  m_tx_stream_length;                    /**< Total length of data packet to be transmitted. */
static volatile uint16_t  m_tx_stream_index;                     /**< Index in data packet for next byte to be transmitted. */
static          uint8_t   m_tx_length_buf[SER_PHY_HEADER_SIZE];  /**< Buffer needed in transmission of packet length */

static          uint8_t * mp_rx_stream;                          /**< Pointer to current receive buffer. */
static volatile uint16_t  m_rx_stream_length;                    /**< Length of receive buffer. */
static volatile uint16_t  m_rx_stream_index;                     /**< Index in receive buffer where the next byte will be placed. */
static volatile bool      m_rx_stream_header;                    /**< Indication of whether header data (true) or payload data (false) is currently being received. */
static          uint8_t   m_rx_length_buf[SER_PHY_HEADER_SIZE];  /**< Buffer needed in reception of packet length */
static          uint8_t   m_rx_drop_buf[1];                      /**< Additional buffer, needed by packet dropping functionality. */

static volatile uart_states_t m_rx_state            = UART_IDLE; /**< State of the RX state machine. */
static volatile uart_states_t m_tx_state            = UART_IDLE; /**< State of the TX state machine. */
static volatile bool          m_tx_pending          = false;     /**< If TX state is UART_STALL and a byte is ready for tranmission the pending flag is set to true. */
static volatile bool          m_cts_high_disconnect = false;     /**< If CTS was sampled low when last byte was transmitted this flag is set to true to indicate that a switch from low->high on CTS should be interpreted as transmission has completed and UART is to be disabled to save power. */

static volatile ser_phy_events_handler_t m_ser_phy_event_handler;
static volatile ser_phy_evt_t            m_ser_phy_event_rx;
static volatile ser_phy_evt_t            m_ser_phy_event_tx;


static void uart_peripheral_disconnect_flow(void)
{
    NRF_GPIO->OUTSET = 1 << SER_PHY_UART_RTS;
    nrf_gpio_cfg_output(SER_PHY_UART_RTS);

    NRF_UART0->PSELCTS = UART_PIN_DISCONNECTED;
    NRF_UART0->PSELRTS = UART_PIN_DISCONNECTED;
    NRF_UART0->CONFIG &= ~(UART_CONFIG_HWFC_Enabled << UART_CONFIG_HWFC_Pos);
}


static void uart_peripheral_connect_flow(void)
{
    NRF_UART0->PSELCTS = SER_PHY_UART_CTS;
    NRF_UART0->PSELRTS = SER_PHY_UART_RTS;
    NRF_UART0->CONFIG |= (UART_CONFIG_HWFC_Enabled << UART_CONFIG_HWFC_Pos);
}


static void uart_peripheral_enable(void)
{
    if (!(NRF_UART0->ENABLE & (UART_ENABLE_ENABLE_Enabled << UART_ENABLE_ENABLE_Pos)))
    {
        NRF_UART0->PSELCTS       = SER_PHY_UART_CTS;
        NRF_UART0->PSELRTS       = SER_PHY_UART_RTS;
        NRF_UART0->CONFIG       |= (UART_CONFIG_HWFC_Enabled << UART_CONFIG_HWFC_Pos);
        NRF_UART0->TASKS_STARTRX = 1;
        NRF_UART0->TASKS_STARTTX = 1;
        NRF_UART0->ENABLE        = (UART_ENABLE_ENABLE_Enabled << UART_ENABLE_ENABLE_Pos);
    }
}


